In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
# generate 120 random numbers btwn Kshs. 4000 and 20000 using numpy
random_numbers = np.random.randint(4000, 20000, size=120)

In [4]:
# display random numbers
random_numbers

array([10119, 12720, 16304, 18859,  4285, 18820, 18022,  8186, 18266,
        7193, 17782, 17767, 15307, 10643,  4676, 12988, 11897, 17202,
        7554, 17787,  4857,  4793, 13731, 11903,  6639, 11422, 11180,
        5933,  6531, 15245, 17214, 16415,  8682,  6004, 13592, 14248,
       14137, 18828, 14860,  5987, 11039, 17381, 13968,  4474, 16979,
        5967, 16298, 15249, 10892,  7039, 13669, 11647, 13889, 12490,
        4112, 17259, 18053,  7674, 12596,  9211, 11629,  9737,  5306,
        8624, 10258,  6180, 16235,  7293, 13245, 19824,  7416, 16279,
       16343, 10083,  8438, 17513, 13525, 13779, 14418,  9720, 19711,
        5399, 14327, 10307, 10010,  4546,  4764,  4467,  7764,  9734,
       10330,  9493, 15472, 16254, 11514, 15029, 12088,  5841, 15139,
       12255, 12457, 16865,  5400,  6029, 16622, 16165,  6925, 12791,
       15394,  4305, 14359, 10796, 19753, 11592,  6610, 18555, 19274,
        7680, 19389, 18961])

In [5]:
type(random_numbers)

numpy.ndarray

In [6]:
# creating a series
houseprices = pd.Series(random_numbers, name="Numbers")
houseprices

0      10119
1      12720
2      16304
3      18859
4       4285
       ...
115    18555
116    19274
117     7680
118    19389
119    18961
Name: Numbers, Length: 120, dtype: int32

In [7]:
houseprices.head()

0    10119
1    12720
2    16304
3    18859
4     4285
Name: Numbers, dtype: int32

In [8]:
houseprices.head(7)

0    10119
1    12720
2    16304
3    18859
4     4285
5    18820
6    18022
Name: Numbers, dtype: int32

In [9]:
# display the first 7 houses
houseprices.head(7)

0    10119
1    12720
2    16304
3    18859
4     4285
5    18820
6    18022
Name: Numbers, dtype: int32

In [10]:
# display the last 7 houses
houseprices.tail(-7)

7       8186
8      18266
9       7193
10     17782
11     17767
       ...
115    18555
116    19274
117     7680
118    19389
119    18961
Name: Numbers, Length: 113, dtype: int32

In [11]:
# creating a function that will take in the price of the house and returning the category
def house_category(price):
    if price >= 15000:
        return "High Class"
    elif price >=10000:
        return "Middle Class"
    else:
        return "slum"

In [12]:
# testing the function
x = house_category(16000)
x

'High Class'

In [13]:
# testing the function
x = house_category(4000)
x

'slum'

In [14]:
# testing the function
x = house_category(11000)
x

'Middle Class'

In [15]:
# applying the function created above to the series
house_categories = pd.Series(houseprices).apply(house_category)
house_categories

0      Middle Class
1      Middle Class
2        High Class
3        High Class
4              slum
           ...
115      High Class
116      High Class
117            slum
118      High Class
119      High Class
Name: Numbers, Length: 120, dtype: object

In [16]:
house_taxed_price = pd.Series(houseprices).apply(lambda price:price*1.10) 
house_taxed_price

0      11130.9
1      13992.0
2      17934.4
3      20744.9
4       4713.5
        ...
115    20410.5
116    21201.4
117     8448.0
118    21327.9
119    20857.1
Name: Numbers, Length: 120, dtype: float64

In [17]:
houses_garbage = pd.Series(houseprices).apply(lambda price:price+250) 
houses_garbage

0      10369
1      12970
2      16554
3      19109
4       4535
       ...
115    18805
116    19524
117     7930
118    19639
119    19211
Name: Numbers, Length: 120, dtype: int64

In [29]:
data = { "Houses Prices": houseprices ,
        "Taxed Prices": house_taxed_price ,
        "Garbage Added" :houses_garbage,
        "House Category": house_categories
       
       }

data

{'Houses Prices': 0      10119
 1      12720
 2      16304
 3      18859
 4       4285
        ...
 115    18555
 116    19274
 117     7680
 118    19389
 119    18961
 Name: Numbers, Length: 120, dtype: int32,
 'Taxed Prices': 0      11130.9
 1      13992.0
 2      17934.4
 3      20744.9
 4       4713.5
         ...
 115    20410.5
 116    21201.4
 117     8448.0
 118    21327.9
 119    20857.1
 Name: Numbers, Length: 120, dtype: float64,
 'Garbage Added': 0      10369
 1      12970
 2      16554
 3      19109
 4       4535
        ...
 115    18805
 116    19524
 117     7930
 118    19639
 119    19211
 Name: Numbers, Length: 120, dtype: int64,
 'House Category': 0      Middle Class
 1      Middle Class
 2        High Class
 3        High Class
 4              slum
            ...
 115      High Class
 116      High Class
 117            slum
 118      High Class
 119      High Class
 Name: Numbers, Length: 120, dtype: object}

In [30]:
moringa = pd.DataFrame(data)

In [31]:
moringa

     Houses Prices  Taxed Prices  Garbage Added House Category
0            10119       11130.9          10369   Middle Class
1            12720       13992.0          12970   Middle Class
2            16304       17934.4          16554     High Class
3            18859       20744.9          19109     High Class
4             4285        4713.5           4535           slum
..             ...           ...            ...            ...
115          18555       20410.5          18805     High Class
116          19274       21201.4          19524     High Class
117           7680        8448.0           7930           slum
118          19389       21327.9          19639     High Class
119          18961       20857.1          19211     High Class

[120 rows x 4 columns]

In [32]:
moringa.head(7)

   Houses Prices  Taxed Prices  Garbage Added House Category
0          10119       11130.9          10369   Middle Class
1          12720       13992.0          12970   Middle Class
2          16304       17934.4          16554     High Class
3          18859       20744.9          19109     High Class
4           4285        4713.5           4535           slum
5          18820       20702.0          19070     High Class
6          18022       19824.2          18272     High Class

In [33]:
moringa.tail(7)

     Houses Prices  Taxed Prices  Garbage Added House Category
113          11592       12751.2          11842   Middle Class
114           6610        7271.0           6860           slum
115          18555       20410.5          18805     High Class
116          19274       21201.4          19524     High Class
117           7680        8448.0           7930           slum
118          19389       21327.9          19639     High Class
119          18961       20857.1          19211     High Class